In [1]:
import pandas as pd

In [2]:
df0=pd.DataFrame([[1,3,2],[4,6,5],[10,8,9]],columns=['A','B','C'])

In [3]:
df0

    A  B  C
0   1  3  2
1   4  6  5
2  10  8  9

In [4]:
df1=pd.DataFrame([[11,6,12],[14,3,15],[20,8,19]],columns=['X','Y','Z'])

In [5]:
df1

    X  Y   Z
0  11  6  12
1  14  3  15
2  20  8  19

In [6]:
df2=pd.merge(df0,df1,right_on='Y',left_on='B')

In [7]:
df2

    A  B  C   X  Y   Z
0   1  3  2  14  3  15
1   4  6  5  11  6  12
2  10  8  9  20  8  19

In [23]:
f1 = pd.DataFrame({'A1': ['foo', 'bar', 'baz', 'foo'],
                    'value1': [1, 2, 3, 5]})
df3 = pd.DataFrame({'B2': ['foo', 'bar', 'baz', 'foo'],
                    'value2': [5, 6, 7, 8]})

In [24]:
f1

    A1  value1
0  foo       1
1  bar       2
2  baz       3
3  foo       5

In [30]:
df3

    B2  value2
0  foo       5
1  bar       6
2  baz       7
3  foo       8

In [32]:
f1.merge(df3, right_on='B2', left_on='A1',
          suffixes=('_right', '_left'))

    A1  value1   B2  value2
0  foo       1  foo       5
1  foo       1  foo       8
2  foo       5  foo       5
3  foo       5  foo       8
4  bar       2  bar       6
5  baz       3  baz       7

In [36]:
f1.merge(df3, left_on='A1',right_on='B2',suffixes=(False, False))

    A1  value1   B2  value2
0  foo       1  foo       5
1  foo       1  foo       8
2  foo       5  foo       5
3  foo       5  foo       8
4  bar       2  bar       6
5  baz       3  baz       7

In [37]:
df4 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df5 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})

In [38]:
df4

     a  b
0  foo  1
1  bar  2

In [39]:
df5

     a  c
0  foo  3
1  baz  4

In [40]:
df4.merge(df5, how='inner', on='a')

     a  b  c
0  foo  1  3

In [41]:
df4.merge(df5,how='left',on='a')

     a  b    c
0  foo  1  3.0
1  bar  2  NaN

In [42]:
df6 = pd.DataFrame({'left': ['foa', 'bar']})
df7 = pd.DataFrame({'right': [7, 8]})

In [43]:
df6

  left
0  foa
1  bar

In [44]:
df7

   right
0      7
1      8

In [45]:
df6.merge(df7, how='cross')

  left  right
0  foa      7
1  foa      8
2  bar      7
3  bar      8